# Exercise 1 -  Sakila Star Schema & ETL  

All the database tables in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

# STEP0: Using ipython-sql

- Load ipython-sql: `%load_ext sql`

- To execute SQL queries you write one of the following atop of your cell: 
    - `%sql`
        - For a one-liner SQL query
        - You can access a python var using `$`    
    - `%%sql`
        - For a multi-line SQL query
        - You can **NOT** access a python var using `$`


- Running a connection string like:
`postgresql://postgres:postgres@db:5432/pagila` connects to the database

## 1.1 Connect to the pagila database

In [1]:
%load_ext sql

In [3]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'xxxx'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:Met/14/7472@127.0.0.1:5432/pagila

In [5]:
%sql $conn_string

## 2.1 How much? What data sizes are we looking at?

In [6]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t\t=", nCountry[0][0])

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry		= 109

## 2.2 When? What time period are we talking about?

In [8]:
%%sql
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2020, 1, 24, 22, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.datetime(2020, 5, 14, 13, 44, 29, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)))]

## 2.3 Where? Where do events in this database occurs?

Todo: Write a query that displays the number of addresses by district in the address table. Limit the table to the top 10 districts.

In [11]:
%%sql
select district, sum(city_id) as n 
from address
group by district
order by n desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790)]

### 3.1 Insight 1: Top Grossing Movies
-   Payments amounts are in table *payment*
-   Movies are in table film
-   THey are not directly linked, payment refers to a rental, rental refers to an inventory item and inventory item refers to a film
-   payment -> rental -> inventory -> film

### 3.1.1 Films

In [12]:
%%sql
select film_id, title, release_year, rental_rate, rating from film limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

### Payments

In [13]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2020, 1, 24, 22, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2020, 1, 25, 16, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2020, 1, 28, 22, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2020, 1, 29, 1, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2020, 1, 29, 9, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)))]

### Inventory

In [14]:
%%sql 
select * from inventory limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2020, 2, 15, 11, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (2, 1, 1, datetime.datetime(2020, 2, 15, 11, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (3, 1, 1, datetime.datetime(2020, 2, 15, 11, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (4, 1, 1, datetime.datetime(2020, 2, 15, 11, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (5, 1, 2, datetime.datetime(2020, 2, 15, 11, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)))]

### 3.1.4 Get the movie of every payment

In [15]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id)
JOIN film f ON ( i.film_id = f.film_id)
limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2020, 1, 24, 22, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2020, 1, 25, 16, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2020, 1, 28, 22, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2020, 1, 29, 1, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2020, 1, 29, 9, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 269)]

### 3.1.5 Sum movie rental revenue
TODO: Write a query that displays the amount of revenue from each title. Limit the results to the top 10 grossing titles.

In [16]:
%%sql
SELECT title, sum(p.amount) as revenue
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
GROUP BY title
ORDER BY revenue desc
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

### 3.2 Insight 2: Top grossing cities
-   Payments amounts are in table Payments
-   Cities are in table cities
-   Payment -> customer -> address -> city

### 3.2.1 Get the city of each payment

In [17]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city
FROM payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
ORDER BY p.payment_date
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

### 3.2.2 Top grossing cities
TODO: Write a query that returns the total amount of revenue by city as measured by the amount variable in the payment table. Limit the results to the top 10 cities. Your should match the table below.

In [18]:
%%sql
SELECT ci.city, sum(p.amount) as revenue
FROM payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
GROUP BY ci.city
ORDER BY revenue DESC
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

## 3.3 Insight 3: Revenue of a movie by customer city by month

### 3.3.1 Total revenue by month

In [19]:
%%sql 
SELECT sum(p.amount) as revenue, EXTRACT(month FROM p.payment_date) as month
FROM payment p
group by month
order by revenue DESC
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(Decimal('28559.46'), 4.0),
 (Decimal('23886.56'), 3.0),
 (Decimal('9631.88'), 2.0),
 (Decimal('4824.43'), 1.0),
 (Decimal('514.18'), 5.0)]

### 3.3.2 Each movie by customer city and by month(data cube)

In [21]:
%%sql
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date, EXTRACT(month FROM p.payment_date) as month
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
ORDER BY p.payment_date
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2020, 1, 24, 22, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2020, 1, 24, 22, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2020, 1, 24, 22, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2020, 1, 24, 22, 33, 7, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2020, 1, 24, 22, 33, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2020, 1, 24, 22, 36, 33, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2020, 1, 24, 22, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2020, 1, 24, 23, 0, 12, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2020, 1, 24, 23, 29, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2020, 1, 24, 23, 30, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 1.0)]

### 3.3.3 SUm of revenue of each movie by customer city and by month
TODO: Write a query that returns the total amount of revenue for each movie by customer city and by month. Limit the results to the top 10 movies. Your result should match the table below.

In [24]:
%%sql
SELECT f.title, city, EXTRACT(month from p.payment_date) as month, sum(amount) as revenue
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN customer c ON (r.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
group by f.title, ci.city, month
order by month, revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('SHOW LORD', 'Mannheim', 1.0, Decimal('11.99')),
 ('CASUALTIES ENCINO', 'Warren', 1.0, Decimal('10.99')),
 ('KISSING DOLLS', 'Toulon', 1.0, Decimal('10.99')),
 ('AMERICAN CIRCUS', 'Callao', 1.0, Decimal('10.99')),
 ('TELEGRAPH VOYAGE', 'Naala-Porto', 1.0, Decimal('10.99')),
 ('STRANGER STRANGERS', 'Ipoh', 1.0, Decimal('9.99')),
 ('HEAD STRANGER', 'Xiangtan', 1.0, Decimal('9.99')),
 ('MISSION ZOOLANDER', 'Abha', 1.0, Decimal('9.99')),
 ('MILLION ACE', 'Gaziantep', 1.0, Decimal('9.99')),
 ('DARKO DORADO', 'Bhilwara', 1.0, Decimal('9.99'))]